
#Область ПрограммныйИнтерфейс


// Нормализованный номер телефона.
// 
// Параметры:
//  НомерТелефона - Строка
//  ВызыватьИсключение - Булево
// 
// Возвращаемое значение:
//  Строка
//  
Функция НормализованныйНомерТелефона(НомерТелефона, ВызыватьИсключение = Ложь) Экспорт

	Цифры = "01234556789";
	
	ЦифрыНомера = "";
	
	Для СЧ = 1 По СтрДлина(НомерТелефона) Цикл
		Символ = Сред(НомерТелефона, СЧ, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЦифрыНомера = ЦифрыНомера + Символ;
		
	КонецЦикла;	
	
	Если СтрНачинаетсяС(ЦифрыНомера, "8") Тогда
		ЦифрыНомера = "7" + Сред(ЦифрыНомера, 2);	
	КонецЕсли;
	
	МассивОшибок = Новый Массив;
	
	Если НЕ СтрНачинаетсяС(ЦифрыНомера, "7") Тогда
		МассивОшибок.Добавить("Первый символ должен быть 7 или 8");
	КонецЕсли;
	
	Если НЕ (СтрДлина(ЦифрыНомера) = 11) Тогда
		МассивОшибок.Добавить("Должно быть 11 цифр в номере");
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрСоединить(МассивОшибок, ";");
		Иначе
			Возврат "";
		КонецЕсли;		
	КонецЕсли;	
	
	Возврат ЦифрыНомера;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
